{"q_id": "32wvn8", "subreddit": "explainlikeimfive", "url": "http://www.reddit.com/r/explainlikeimfive/comments/32wvn8/eli5_whats_the_difference_between_a_forest_and_a/", "sinhala_question": "වනාන්තරයක් සහ කැළයක් අතර වෙනස කුමක්ද?", "sinhala_answer": "ඒවා එකිනෙකට හුවමාරු ලෙස බොහෝ විට භාවිතා වේ. ඔබට විවිධ සම්පත් වලින් විවිධ පිළිතුරු ලැබෙනු ඇත, නමුත් සාමාන්‍ය එකඟතාවය නම් වනාන්තරවලට වඩා කැළය කුඩා බවයි. &gt; කැළයක් යනු වත්තකට හෝ වදුලකට වඩා විශාල ගස් වලින් වැසී ඇති ප්‍රදේශයකි. වනාන්තරයක් යනු ගස් වලින් වැසී ඇති ප්‍රදේශයකි, නමුත් එය කැළයක් වඩා විශාලය &gt; එක්සත් ජනපදයේ ජාතික වෘක්ෂලතා වර්ගීකරණ පද්ධතිය ඒවායේ ඝනත්වය අනුව ඒවා වෙන්කර හඳුනා ගනී: aa කැළයෙන් සියයට 25 සිට 60 දක්වා ප්‍රමාණයක් ගස් වියන් වලින් වැසී ඇති අතර සියයට 60 සිට 100 දක්වා වනාන්තරයක් වියන් සහිත ය.", "english_question": "what's the difference between a forest and a wood?", "english_answer": "They're used interchangeably a lot. You'll get different answers from different resources, but the general consensus seems to be that woods are smaller than forests.\n\n >  A wood is an area covered in trees, larger than a grove or a copse. A forest is also an area covered in trees, but it is larger than a wood\n\n >  The U.S. National Vegetation Classification system differentiates them according to their densities: 25 to 60 percent of a a wood is covered by tree canopies, while 60 to 100 percent of a forest is canopied."}
{"q_id": "1yc9zg", "subreddit": "AskHistorians", "url": "http://www.reddit.com/r/AskHistorians/comments/1yc9zg/are_there_any_good_source_material_on_the_warsaw/", "sinhala_question": "Warsaw Ghetto හි මාර්ගගතව ලබා ගැනීමට හොඳ මූලාශ්‍ර ද්‍රව්‍ය තිබේද?", "sinhala_answer": "අදාළ ප්‍රාථමික මූලාශ්‍ර බොහොමයක එම නිශ්චිත විස්තර එකතු කළ ආකාරයෙන් අඩංගු නොවේ. Warsaw Ghetto වෙතින් එන දිනපොත් සහ වාර්තා පිළිබඳ විශිෂ්ට උදාහරණ කිහිපයක් තිබේ. ඔබ සොයන සංඛ්‍යාලේඛන ද්විතීයික මූලාශ්‍රවලින් පැමිණිය හැකිය. එක් විශිෂ්ට උදාහරණයක් වන්නේ ස්ට්රෝප් වාර්තාවයි. මෙය අණ දෙන නිලධාරියෙකු (ස්ට්රෝප්) විසින් ලියන ලද අතර එය නැගිටීම මර්දනය කිරීම ලේඛනගත කරයි. ඔබට සම්පූර්ණ වාර්තාව [මෙතැනින්](_URL_1_) ලබා ගත හැකි ජාතික ලේඛනාගාරයට සබැඳියක් මම ඇතුළත් කර ඇත. මෙම ලේඛනය නියුරම්බර්ග් නඩු විභාගයේදී භාවිතා කරන ලදී. මම ඔබට [Yad Vashem අඩවිය](_URL_2_) පරීක්ෂා කිරීමට නිර්දේශ කරමි. ඒ ඊශ්‍රායලයේ හොලොකෝස්ට් කෞතුකාගාරයයි. යුදෙව්වන්ගේ සමූලඝාතනය (ෂෝහ්) පිළිබඳ මූලික මූලාශ්‍ර, ඡායාරූප, පුද්ගලික ගිණුම් ආදිය එකතු කිරීමට ඔවුන් බොහෝ කාලයක් ගත කර ඇත. මම Warsaw Ghetto හි දළ විශ්ලේෂණයට සම්බන්ධ කර ඇත, නමුත් ඉහළින් ඇති ඩිජිටල් එකතුව පරීක්ෂා කරන්න. අන්තිම පුංචි ඉඟිය තමයි ඒ කාලයේ දිනපොත්. ඔබ සිටින්නේ කොහේදැයි මම නොදනිමි, හෝ ඔබට ප්‍රවේශය ඇත්තේ කුමන පුස්තකාලවලටද යන්න මම නොදනිමි, නමුත් මෙහි සමහර කැපී පෙනෙන ඒවා සඳහා WorldCat වාර්තා කිහිපයක් ඇත: [Adam Czerniakow ගේ Warsaw දිනපොත](_URL_0_) සහ [වේදනාව පිළිබඳ ලියවිල්ල, Warsaw දිනපොත Chaim A. Kaplan](_URL_3_). මෙම උපකාරය බලාපොරොත්තු වේ. මූලාශ්‍රය: මම ශාස්ත්‍රීය විමර්ශන පුස්තකාලයාධිපතිවරයෙක් සහ යුදෙව් ඉතිහාස විශේෂඥයෙක්", "english_question": "Are there any good source material on the Warsaw Ghetto to be had online?", "english_answer": "Many of the relevant primary sources wont contain the those specific details in an aggregated way. There are a few great examples of diaries and reports coming from the Warsaw Ghetto. The statistics you are looking for would likely come from secondary sources.\n\nOne great example is the Stroop Report. This is written by a commander (Stroop) and it documents the suppression of the uprising. I've included a link  to the National Archive where you can get the the full report [here](_URL_1_). This document was used in the Nuremberg Trials.\n\nI would recommend you check out the [Yad Vashem site](_URL_2_). That is the Holocaust Museum in Israel. They have spent a lot of time collecting primary sources, photos, personal accounts etc, about the Holocaust of the Jews (Shoah). I've linked to the overview of the Warsaw Ghetto, but check out the digital collection at the top.\n\nA last little tip is diaries of the time. I don't know where you're located, or which libraries you have access to but here are a few WorldCat records for some notable ones: [The Warsaw diary of Adam Czerniakow](_URL_0_) and [Scroll of agony, the Warsaw diary of Chaim A. Kaplan](_URL_3_).\n\nHope this help.\n\nSource: I'm an academic reference librarian and Jewish history specialist"}
{"q_id": "elzx1n", "subreddit": "explainlikeimfive", "url": "https://www.reddit.com/r/explainlikeimfive/comments/elzx1n/eli5_we_do_we_instinctively_grab_a_part_of_our/", "sinhala_question": "අපි අපේ ශරීරයේ කොටසක් තුවාල වූ පසු සහජයෙන්ම අල්ලා ගන්නවාද?", "sinhala_answer": "අ) සහජ බුද්ධිය. එය තවදුරටත් හානි වලින් ආරක්ෂා කිරීම සඳහා (හානිකර නියෝජිතයා දිගටම පවතී නම්) හෝ ලේ ගැලීම වැළැක්වීම සහ එවැනි. B) වේදනාව. පීඩන සංවේදනය අත්දැකීමෙන් වේදනා සංවේදනය අවහිර කරන බව අපගේ මොළය දනී. ඒ නිසා අපි තුවාල වූ ස්ථානය ප්‍රත්‍යාවර්තව අල්ලා ගන්නේ එය වේදනාව සමනය කරන බැවිනි. සංස්කරණය කරන්න: ඉංග්රීසි සහ පැහැදිලිකම", "english_question": "we do we instinctively grab a part of our body after it is hurt?", "english_answer": "A) instinct. To protect it from further damage (if the damaging agent is ongoing) or to prevent bleeding and such.\n\nB) pain. Our brain knows that pressure sensation blocks pain sensation from experience. So we reflexively grab the injury site because it alleviates the pain.\n\nEdit: English and clarity"}
{"q_id": "1j7pwx", "subreddit": "AskHistorians", "url": "http://www.reddit.com/r/AskHistorians/comments/1j7pwx/following_the_passing_of_the_thirteenth_amendment/", "sinhala_question": "දහතුන්වන සංශෝධනය සම්මත වීමෙන් පසුව, වහල් හිමියන් නීති විරෝධී ලෙස එම පුරුද්ද දිගටම කරගෙන යාමට උත්සාහ කළ අවස්ථා තිබේද?", "sinhala_answer": "සිවිල් යුද්ධයෙන් පසු වසර කිහිපය තුළ දකුණ පුරා &quot;කළු කේත&quot; මාලාවක් නීතියට සම්මත විය. ඔවුන්ගේ පරමාර්ථය වූයේ නිදහස් වූ වහලුන් සදාකාලික ලෙස ලේබල් කිරීම මගින් ඔවුන්ගේ බලහත්කාර ශ්‍රමය සාධාරණීකරණය කිරීම, අත්‍යවශ්‍යයෙන්ම විරැකියාව නීති විරෝධී කිරීම සහ එමඟින් හිටපු වහලෙකුට වැඩ කිරීමට බල කිරීමට රාජ්‍යයකට ඉඩ දීමෙන් ඔවුන් අත්අඩංගුවට ගෙන සිරකරුවන් ලෙස භාවිතා කිරීමයි. සමහර විට, කළු කේත හුදෙක් සිවිල් යුද්ධයට පෙර වහල් නීති වූ අතර &quot;වහල්&quot; යන වචනය වෙනුවට &quot;නීග්‍රෝ&quot; යන වචනය යොදන ලදී.", "english_question": "Following the passing of the Thirteenth Amendment, were there any cases of slave-owners attempting to continue the practice illegally?", "english_answer": "All across the South during the years following the civil war, a series of \"Black codes\" were passed into law. Their purpose was to effectively re-enslave the freed slaves by justifying their forced labor by labeling them vagrants, essentially making unemployment illegal and thereby allowing a state to force a former slave to work by arresting them and then using them as convict labor.\n\nSometimes, the black codes were simply pre-civil war slave laws with the word \"slave\" replaced with \"negro.\""}
{"q_id": "3qr7uu", "subreddit": "AskHistorians", "url": "https://www.reddit.com/r/AskHistorians/comments/3qr7uu/in_medieval_and_premodern_times_political/", "sinhala_question": "මධ්‍යතන යුගයේ සහ පූර්ව නූතන යුගයේ දේශපාලන ආයතන සාමය සුරක්ෂිත කිරීම සඳහා උරුමක්කාරයන් අතර විවාහ ගිවිසුම් ඇති කර ගත්හ. බොහෝ විට, මෙය වසර 20 කට වඩා වැඩි කාලයක් පැවතුනේ නැත, අඩු නොවේ නම්. ඔවුන් පවා කරදර කළේ ඇයි?", "sinhala_answer": "අවුරුදු විස්සක සාමය කිසි සේත්ම සාමයක් නොමැති වීමට වඩා හොඳය. තරුණ පරම්පරාවකට හමුදා සේවය අත්හැරීමට, යටිතල පහසුකම් ගොඩනැගීමට, බලය තහවුරු කර ගැනීමට සහ භාණ්ඩාගාරයක් වර්ධනය කිරීමට කාලය ප්‍රමාණවත්ය. වසර විස්සකට වඩා වැඩි කාලයක් පවතින සාමය පිළිබඳ උදාහරණ ඕනෑ තරම් තිබේ, නැතහොත් ස්ථිර සාමයක් සහ ඒකාබද්ධතාවයක් ඇති කරයි. ස්පාඤ්ඤයේ ජාතිය පිහිටුවන ලද්දේ [කැස්ටිල් රාජධානියේ සහ අරගොන් රාජධානියේ] (_URL_0_), අනාගත රැජින වන කැස්ටිලයේ ඉසබෙලා, අනාගත රජු වන කතෝලික ෆර්ඩිනන්ඩ් සමඟ විවාහ වූ විට ආරම්භ වූ සංගමයකිනි. අරගොන්. ඔවුන්ගේ මුනුබුරා වන චාල්ස් V සහ මී මුනුබුරා II වන පිලිප් පසුව එක්සත් ස්පාඤ්ඤයේ රජවරුන් බවට පත් විය. ස්කොට්ලන්තයේ VI වන ජේම්ස් 1603 දී Iවන ජේම්ස් බවට පත් වූ විට එංගලන්තයේ ඔටුන්න හිමි වූ විට එංගලන්තයේ සහ ස්කොට්ලන්තයේ පෞද්ගලික එකමුතුව අධීක්ෂණය කළේය. එංගලන්තය සහ ස්කොට්ලන්තය පසුව 1707 දී මහා බ්‍රිතාන්‍ය රාජධානිය බවට පත්වීමට නිල වශයෙන් එකට එකතු වනු ඇත. ඔබේ ප්‍රශ්නයද සාම ගිවිසුමක් වසර විස්සකට වඩා අඩු කාලයක් පැවතීම විශේෂයෙන් අසාමාන්‍ය බව එයින් ගම්‍ය වේ. වසර විස්සකට වඩා වැඩි කාලයක් සාමය පවත්වා ගෙන නොගිය නවීන ගිවිසුම් සඳහා බොහෝ උදාහරණ තිබේ. ලෝක යුද්ධ (1918 සිට 1939 දක්වා) අතර වසර විසි එකක් පමණක් පැවති අතර ගල්ෆ් යුද්ධය (1991 අවසන්) සහ ඉරාක යුද්ධය (2003 ආරම්භය) අතර වසර දොළහක් පමණි. ඇසුවොත් මට වඩා හොඳ මූලාශ්‍ර ඇතුළත් කිරීමට උත්සාහ කළ හැකිය, නමුත් මා මෙහි පැවසූ කිසිවක් මතභේදාත්මක යැයි මම නොසිතමි.  ", "english_question": "In medieval and pre-modern times, political entities made marriage pacts between heirs in order to secure peace. Often times, this didn't last for more than 20 years, if not even less. Why did they even bother?", "english_answer": "Twenty years of peace is much better than no peace at all.  Twenty years is enough time for a generation of young men to forgo military service, time to build infrastructure, time to consolidate power, and time grow a treasury.\n\nThere are also plenty of examples of peaces that last longer than twenty years, or even result in permanent peace and consolidation.  The nation of Spain was formed from [the union of the Kingdom of Castile and the Kingdom of Aragon](_URL_0_), a union that was set in motion when Isabella of Castile, the future queen, married Ferdinand the Catholic, a future king of Aragon.  Their grandson Charles V and great grandson Phillip II would later become kings of a united Spain.  James the VI of Scotland similarly oversaw the personal union of England and Scotland when he inherited the crown of England, becoming James I, in 1603.  England and Scotland would later formally join together to become the Kingdom of Great Britain in 1707.\n\nYour question also implies that it is particularly unusual for a peace treaty to last less than twenty years.  There are numerous examples of more modern treaties that did not maintain peace for much longer than twenty years.  There were only twenty-one years between the World Wars (1918 to 1939) and only twelve years between the Gulf War (ended 1991) and the Iraq War (began 2003).\n\nI can try to include better sources if asked, but I don't think anything I've said here is controversial.  "}
{"q_id": "fvbxhi", "subreddit": "AskHistorians", "url": "https://www.reddit.com/r/AskHistorians/comments/fvbxhi/what_happened_to_german_and_italian_volunteers_in/", "sinhala_question": "ස්පාඤ්ඤ සිවිල් යුද්ධයේ ජාත්‍යන්තර බලසේනාවන් 1938 දී විසුරුවා හැරීමෙන් පසු ජර්මානු සහ ඉතාලි ස්වේච්ඡා සේවකයන්ට සිදු වූයේ කුමක්ද?", "sinhala_answer": "මම මෙයට සාපේක්ෂ වශයෙන් කෙටි පිළිතුරක් ලබා දුන්නා [මෙහි](_URL_0_), ජර්මානුවන් කෙරෙහි වැඩි අවධානයක් යොමු කරමින් (මා සතුව අදාළ මූලාශ්‍රයක් තිබුණේ ඔවුන් සඳහා). අදින් පසුව මට අවස්ථාවක් ලැබුණහොත්, මම එය පුළුල් කිරීමට උත්සාහ කරමි!", "english_question": "What happened to German and Italian volunteers in the International Brigades of the Spanish Civil War after they were disbanded in 1938?", "english_answer": "I gave a relatively brief answer to this [here](_URL_0_), focusing more on the Germans (for whom I had a relevant source handy). If I get the chance later today, I'll try and expand on it!"}
{"q_id": "31qce9", "subreddit": "AskHistorians", "url": "http://www.reddit.com/r/AskHistorians/comments/31qce9/what_if_anything_did_native_americans_think_lay/", "sinhala_question": "පැසිෆික් සහ අත්ලාන්තික් සාගරවලින් ඔබ්බට පිහිටා ඇතැයි ස්වදේශික ඇමරිකානුවන් සිතුවේ (යම් දෙයක් නම්) කුමක්ද?", "sinhala_answer": "ඇමරිකාවේ නිරිතදිග කාන්තාර ජනතාව සාමාන්‍යයෙන් සාගර පිළිබඳ සංකල්පය තේරුම් ගෙන ඇත්තේ විශාල විලකට හෝ ඇළකට වඩා මූලික වශයෙන් වෙනස් නොවන බවයි. O&#39;odham ජනයාගේ [වාර්තාගත] නිර්මාණ මිථ්‍යාවන් අතර, දුරස්ථ ජනයාගේ පැවැත්ම අපැහැදිලි වුවද, කුඩා ගංගා විශාල සාගර බවට පත් කරමින්, පෘථිවියේ මුල් ජනයා වෙන් කරන දෙවිවරුන් හෝ දේවතාවුන් වහන්සේලා අවම වශයෙන් දෙකක් අඩංගු වේ. ඉන් එක් කථාවක් පසුකාලීනව මුහුදේ අනෙක් පැත්තේ ගංවතුරෙන් දිවි ගලවා ගත්, පහසු සුදු පැහැති සමක් ඇති මිනිසුන් ගැන සාකච්ඡා කරයි. එම මූලාශ්‍රයේම තවත් ඡේදයක සඳහන් වන්නේ සාගරයට ඉහළින් සිටි තවත් පිරිසක් ඇත්ත වශයෙන්ම තද දුඹුරු පැහැයෙන් සිටි බවයි. මෙම කණ්ඩායම් දෙකම මැවීමේ වැරදි වල ප්‍රතිඵලයක් වූ අතර ඉන් පසුව පරිපූර්ණ වර්ණ ගැන්වූ Hohokam කණ්ඩායම් නිර්මාණය විය. මේවා අනාවැකිමය ලෙස පෙනුනද, මෙම කථා වල අපගේ එක් මූලාශ්‍රයක් 1930 ගණන්වල පූජකයෙකු විසින් බේබද්දෙකුගෙන් පටිගත කරන ලදී. අද ඉතිරිව ඇති ඕ&#39;ඔදම්හි එකම අර්ධ-සම්පූර්ණ ඉතිහාසය එය වන බැවින්, තනි මූලද්‍රව්‍ය කෙතරම් ආපස්සට යයිද යන්න තීරණය කිරීමට අපට ක්‍රමයක් නොමැත. Hopi සහ අනෙකුත් Puebloan ජනයා අතර, සාගර යනු ගොඩබිමේ සම්පූර්ණ අවසානය නොවන බව අපට අවබෝධයක් ඇත. අත්ලාන්තික් සහ පැසිෆික් වෙරළට ඔබ්බෙන් වූ දූපත් වල මිනිසුන් ජීවත් වූයේ මුහුදට ආසන්නව ජීවත් වන කණ්ඩායම් සමඟ වෙළඳාමෙන් බව අවම වශයෙන් ඔවුන් තේරුම් ගත්හ. දෙපිරිසටම සාගර අතර තම මහාද්වීපයේ භූගෝල විද්‍යාව පිළිබඳ නිවැරදි අවබෝධයක් සහ අසල්වැසියන්ට මෙන් මිනිසුන්ට ජලය මත ජීවත් විය හැකි බවට අවබෝධයක් තිබුණි. මහා ගංගාවකට හෝ වැවකට සමාන බව වැටහුණු ජලයෙන් එතෙර වූ තමන්ගේ ඉඩම්වලට සමාන වෙනත් ඉඩම් ඔවුන් පිළිසිඳ ගත්තා වන්නට බැරි නැත. මෙම අවබෝධය පිළිබඳව අපට ඉඟි කර ඇති කථාන්දර, නමුත් O&#39;odham සහ Yuman ජනයා පිළිබඳ ඓතිහාසික වාර්තා සම්පූර්ණයෙන්ම නොමැති වීම එම යෝජනාව හොඳම ලෙස සමපේක්ෂනය කරයි. Puebloans අතර තත්වය ටිකක් හොඳ ය. ඔවුන් යාත්‍රා කිරීම පිළිබඳ සංකල්පය ඉතා හොඳින් අවබෝධ කරගෙන සිටියද, වෙරළේ සිට නොපෙනෙන විදේශීය රටවල් ගැන මිථ්‍යාවන්හි සඳහන් වන්නේ හිඟය. Bahr, Donald M., et al. *පෘථිවිය මත දෙවිවරුන්ගේ කෙටි, වේගවත් කාලය: Hohokam වංශකතා.* Univ of California Press, 1994. Courlander, Harold, ed. *හොපිස්ගේ හතරවන ලෝකය.* UNM මුද්‍රණාලය, 1971.\n\n", "english_question": "What (if anything) did Native Americans think lay beyond the Pacific and Atlantic oceans?", "english_answer": "The desert people of the American Southwest generally understood the concept of oceans as not being fundamentally different from a large lake or stream. Among the [recorded] creation myths of the O'odham peoples, at least two contain gods or demigods turning small rivers into vast oceans, splitting apart the original peoples of the Earth, although the survival of remote peoples is left ambiguous. One of these stories later goes on to discuss the people who survived the flood on the other side of the ocean, who were conveniently white-skinned. Another passage from the same source states that another group of people over the ocean were in fact dark brown. Both of these groups were the result of mistakes in creation, after which the perfectly colored Hohokam groups were created. As prophetic as these may sound, our one source of these tales was recorded from a drunkard by a priest in the 1930s. Given that it is the only semi-complete history of the O'odham remaining today, we have no means to determine how far back the individual elements go. \n\nAmong the Hopi and other Puebloan peoples, we have an understanding that the oceans were not the complete end of land. At the very least they understood that people lived in the islands off the Atlantic and Pacific coasts from trade with groups living nearer to the sea. \n\nBoth groups had an accurate understanding of the geography of their continent between the oceans and an understanding that humans could live on the water as their neighbors did. It's not impossible that they conceived of other lands similar to their own across the water, which was understood to be similar to a large river or lake. The stories we have hint at this understanding, but the near-complete absence of historical records about the O'odham and Yuman people make that suggestion speculative at best. The situation among the Puebloans is little better. While they clearly understood the concept of sailing quite well, the myths make scarce mention of foreign lands that would not have been visible from shore.\n\nBahr, Donald M., et al. *The short, swift time of gods on earth: The Hohokam chronicles.* Univ of California Press, 1994.\n\nCourlander, Harold, ed. *The fourth world of the Hopis.* UNM Press, 1971.\n\n"}
{"q_id": "11j8u0", "subreddit": "askscience", "url": "http://www.reddit.com/r/askscience/comments/11j8u0/is_it_possible_that_in_the_distant_future_an/", "sinhala_question": "ඈත අනාගතයේදී පෘථිවියේ දැනට පවතින ජීවියෙකු බුද්ධිමත් ජීවයක් ලෙස සැලකිය හැකි මට්ටමට පරිණාමය විය හැකිද? කිට්ටුම සත්වයා පැමිණෙන්නේ කුමක්ද? ", "sinhala_answer": " &gt; ඈත අනාගතයේදී පෘථිවියේ දැනට පවතින ජීවියෙකු බුද්ධිමත් ජීවයක් ලෙස සැලකිය හැකි මට්ටමට පරිණාමය විය හැකිද? ඔව්, එය හැකි ය, නමුත් කිසිසේත් එය ස්ථිර දෙයක් නොවේ. පරිණාමයට ඉලක්කයක් මනසේ නැත, එමෙන්ම අනෙක් ඒවාට වඩා නෛසර්ගිකව යහපත් වූ නිශ්චිත අවසන් ලකුණු ද නැත. පරිණාමය පරිසරයට අනුවර්තනය වන අතර, වැඩ කරන දේ, මිය නොයන දේ. &gt; කිට්ටුවෙන් එන්නේ කුමන සතාද? අපට බුද්ධිය නිර්වචනය කිරීමට අපහසු කාලයක් ඇත *අපගේම විශේෂ තුළ*. ඔබ වෙනත් විශේෂ දෙස බලන විට තාරකා විද්‍යාත්මකව දුෂ්කරතාවය ඉහළ යයි. ඔබ කතා කරන්නේ තාක්ෂණික බුද්ධිය ගැනද? සාගරයේ කිසිවක් තාක්‍ෂණය දියුණු කළ නොහැක (අවම වශයෙන්, අපට පැවසිය හැකි පරිදි - ගින්නක් නොමැතිව බොහෝ මෙවලම් සෑදීම දුෂ්කර වනු ඇත). සමාජ බුද්ධිය? හොඳයි, කෘමීන්ට එහි විශාල වාසියක් ඇති බව පෙනේ ... නමුත් ඒවා බොහෝ විට මෙවලම් ඉදිරිපසින් බැහැර විය හැකිය. etc, etc, etc. ඔබ දුෂ්කරතා දකිනවාද? ", "english_question": "Is it possible that in the distant future, an organism that exists right now on Earth, will evolve to the point that it can be considered intelligent life? Which animal comes the closest? ", "english_answer": " > Is it possible that in the distant future, an organism that exists right now on Earth, will evolve to the point that it can be considered intelligent life?\n\nYes, it's possible, but by no means is it a sure thing.  Evolution doesn't have a goal in mind, nor does it have specific end points that are inherently better than others.  Evolution adapts to the environment, and what works works, what doesn't dies off.\n > Which animal comes the closest?\n\nWe have a difficult time defining intelligence *within our own species*.  The difficulty goes up astronomically when you look at other species.\n\nAre you talking about technic intelligence?  It's unlikely anything in the ocean will ever develop technology (at least, as far as we can tell - without fire lots of tools are going to be difficult to make).\n\nSocial intelligence?  Well, insects seem to have a big advantage there... but they're probably a ways off on the tool front.\n\netc, etc, etc.\n\n\nYou see the difficulties? "}
{"q_id": "1qfda2", "subreddit": "askscience", "url": "http://www.reddit.com/r/askscience/comments/1qfda2/how_much_can_you_learn_from_someones_genome/", "sinhala_question": "කෙනෙකුගේ ජෙනෝමයෙන් ඔබට කොපමණ ඉගෙන ගත හැකිද?", "sinhala_answer": "හොඳයි, මෙය විනෝදජනකයි, අපි මගේ උසස් අණුක ජීව විද්‍යා පාඨමාලාවේ වචනාර්ථයෙන් මේ ආකාරයේ දේවල් ආවරණය කළෙමු. ඔබේ ජෙනෝමය ඔබේ දෙමාපියන්ගෙන් ලැබුණු ජාන මත පදනම්ව වෙනස්කම් අඩංගු වේ. කෙටි කාලීන පුනරාවර්තනයක පිටපත් 11ක් සඳහා ඔබ සමජාතීය විය හැකිය (STR, &#39;අකුරු 2-3&#39; අනුපිළිවෙලින් නැවත නැවතත් පුනරාවර්තනය වේ) එහිදී මම පිටපත් 13 සහ 8 සඳහා විෂමජාතීය වනු ඇත. FBI භාවිතා කරන ඔබේ &quot;DNA ඇඟිලි සලකුණ&quot; මෙම කලාප ඇතුළත් වේ, ඒවා අඩංගු ප්‍රදේශ PCR මගින් විස්තාරණය කළ විට, ඒවා විවිධ දිග ලෙස පෙන්වයි. තවද, තනි-නියුක්ලියෝටයිඩ-බහුරූපතා (SNPs) ඇත, එහිදී ඔබට A එකක් තිබිය හැකි අතර එහිදී මට C (හෝ CA හෝ TG හෝ TA... ඔබට කාරණය වැටහේ). &quot;indels&quot; ද ඇත - එක් හෝ වෙනත් genomre වලට සාපේක්ෂව ඇතුල් කිරීම් හෝ මකාදැමීම්. විශේෂයෙන් ප්‍රෝටීන් කේතීකරණ ජානවල ඇති වුවහොත් මේවා රෝග හෝ වෙනත් ගති ලක්ෂණ සඳහා සලකුණු ලෙස සේවය කළ හැක. මෙම විචලනයන් ඉතා විශාල සංඛ්‍යාවක් ඇති අතර, ඔබ ගැන සමහර ගති ලක්ෂණ මෙන්ම ඔබට ගෙන යා හැකි ප්‍රවේණිගත රෝග ගැන මට පුරෝකථනය කළ හැකි විය (එසේ වුවද 100% නිශ්චිතභාවයට ආසන්න නොවේ). ස්වභාවධර්මය/පෝෂණය පිළිබඳ විවාදය නම් ඔබේ ප්‍රවේණි වර්ගය මට ලබා දිය හැක්කේ කෙසේද යන්නයි. [මෙම දත්ත සමුදාය](_URL_0_) මිනිසා තුළ ඔන්ලයින් මෙන්ඩේලියන් උරුමය ලෙස හඳුන්වනු ලබන අතර රෝග/ලක්ෂණ නාමාවලි සහ ඒවා පිළිබඳ SNP සහ ඉන්ඩෙල් දත්තවල *ධනය* අඩංගු වේ. සමහර පතල් කැණීම් කරමින්, ඔබට [මෙම](_URL_1_) වැනි වගු සොයා ගත හැකි අතර එමඟින් ජානයක් සඳහා දන්නා සියලු ප්‍රභේද ලැයිස්තුගත කර ඒවා පිළිබඳ වැඩිදුර තොරතුරු වෙත සම්බන්ධ වේ. මෙම උදාහරණය Von Willebrands Factor වේ, එහි විකෘති කිරීම් Von Willebrands රෝගය ඇති කරයි, එය මෘදු ලේ ගැලීමේ ආබාධයකි. මම ඔබගේ පසුබිම නොදනිමි, නමුත් මෙම වෙබ් අඩවියේ ඉතා තාක්ෂණික තොරතුරු රාශියක් අඩංගු වේ. ඔබ [23andMe](_URL_2_) ගැන අසා ඇති අතර එය විශේෂිත සලකුණු සඳහාද ඔබේ ජෙනෝමය පරීක්ෂා කරන වාණිජ සේවාවකි. සංස්කරණය කරන්න: ඔබේ පවුල ඔවුන්ගේ ජෙනෝම ද දත්ත ගබඩාවකට ඉදිරිපත් කර ඇත්නම්, අපට ඒවා ද හඳුනා ගත හැකිය", "english_question": "How much can you learn from someone's genome?", "english_answer": "Well this is fun, we literally just covered this kind of stuff in my advanced molecular biology course.\n\nYour genome will contain variation depending on genetics that has been passed down from your parents.  You may be homozygous for 11 copies of a short-tandem repeat (STR, 2-3 'letters' repeated over and over again in the sequence) where I will be heterozygous for 13 and 8 copies. Your \"DNA fingerprint\" that the FBI uses involves these regions, when the areas that contain them are amplified by PCR, they show up as different lengths.\n\nFurthermore, there are single-nucleotide-polymorphisms (SNPs) where you may have an A where I have a C (or C-A or T-G or T-A...you get the point).  There are also \"indels\" - insersions or deletions relative to one genomre or another.  These can serve as markers for disease or other traits, especially if they occur in protein coding genes.  There are a very very large number of these variations, and I could predict (not even close to 100% certainty, though) some traits about you as well as heritable diseases you may carry.  The debate on nature/nurture is how certain could I be given your genotype?\n\n[This database](_URL_0_) is called Online Mendellian Inheritance in Man and catalogs diseases/traits and contains a *wealth* of SNP and indel data about them.  Doing some mining, you can find tables like [these](_URL_1_) that will list all known variants for a gene and link to more information about them.  This example is the Von Willebrands Factor, mutations of which cause Von Willebrands Disease which is a mild bleeding disorder.  I don't know your background, but this site contains a lot of very technical information.\n\nYou may have heard of [23andMe](_URL_2_) which is a commercial service that will assay your genome for specific markers as well.\n\nEDIT: If your family has submitted their genomes to a database as well, we could ID them as well"}
{"q_id": "3s6g1h", "subreddit": "explainlikeimfive", "url": "https://www.reddit.com/r/explainlikeimfive/comments/3s6g1h/eli5_why_are_hispanics_included_as_whites_in/", "sinhala_question": "හිස්පැනික් ජාතිකයන් කළු ජාතිකයන් හෝ ස්වදේශික ඇමරිකානුවන් වැනි ඔවුන්ගේම ස්වාධීන ජනවිකාස ලෙස සලකනු වෙනුවට සංඛ්‍යාලේඛන ඡන්ද විමසීම්වලට සුදු ජාතිකයින් ලෙස ඇතුළත් කරන්නේ ඇයි?", "sinhala_answer": "හිස්පැනික් යනු තරඟයක් නොවේ. එය වාර්ගිකත්වයකි. සුදු හිස්පැනික්වරු, කළු හිස්පැනික්වරු, ස්වදේශික ඇමරිකානු හිස්පැනික්වරු සහ ආසියානු හිස්පැනික්වරු පවා සිටිති.\n\n", "english_question": "why are hispanics included as whites in statistical polls instead of being considered their own independent demographic like blacks or native americans?", "english_answer": "Hispanic is not a race.  It's an ethnicity.  There are white Hispanics, black Hispanics, Native American Hispanics, and even Asian Hispanics.\n\n"}

